# Specialization_project
Итоги блока. Выбор специализации.  IT-специалист.

Задача: "Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Описание решения:

Задаем массив строк stringArray. Элементы массива имеют тип string.

Создаем массив minArray[stringArray.Length]. Длина массива minArray равна длине массива stringArray, что бы элементы массива stringArray уместились в массиве minArray

Сoздаем переменную int count = 0.

Создаем переменную int size = 0 для исключения внутри кода не понятных и не постоянных цифр.

Создаем цикл for. Цикл позволяет последовательно взять каждый элемент массива array для определения длины данного элемента. Выходим из цикла, как только проведен анализ длины последнего элемента.

Создаем условный оператор if. Создаем его внутри цикла for. Данный оператор каждый элемент массива array сравнивает с size. Если сравнение соответствует условию задачи, то значению miniArray[Count] присваивается значение astringArray[i]. Переменную count увеличиваем на 1, что бы перейти к заполнению следующего не обозначенного элемента массива miniArray. После завершения цикла for, мы имеем массив miniArray с элементами, соответствующими условиям задачи. Следующие шаги позволят вывести его на экран.

Вывод массива miniArray на экран. Выводим массив на экран с помощью команды Console.Write.
